Documents/ЗаявкаНаДепозитОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаДепозитОбменСБанками</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БанкОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СчетОрганизацииОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДепозита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозвратаСредств</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПродукта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПродукта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыплатыПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыплатыПроцентовДепозитовОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Капитализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПродукта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДепозита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаДепозита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикВыплатыПроцентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДепозита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаДепозитОбменСБанками/Forms/ФормаВыбораСчетаОткрытия/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("Банк") Тогда
		Банк = Параметры.Банк;
	КонецЕсли;
	
	Если Параметры.Свойство("ДанныеОбОстатке") Тогда
		ИнициализацияСпискаСчетов(Параметры.ДанныеОбОстатке);
	КонецЕсли;
	
	Элементы.Банк.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	
	Если СписокСчетов.Количество() > 0 Тогда
	
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокСчетов.Остаток");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = 0;
		
		ОформляемоеПоле =  ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Использование = Истина;
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетовСуммаОстаткаСтрока");
		
		ЦветТекстаНетОстатка = ЦветаСтиля.НедоступныйДляВыбораЭлементБЭД;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", 
			НСтр("ru = 'Нет данных, загрузите выписку'"));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекстаНетОстатка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСчетов

&НаКлиенте
Процедура СписокСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборСчета(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыборСчета(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборСчета(ИдентификаторСтроки)
	
	ДанныеПоСчету = СписокСчетов.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ДанныеПоСчету <> Неопределено И ЗначениеЗаполнено(ДанныеПоСчету.Ссылка) Тогда
		Закрыть(ДанныеПоСчету.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияСпискаСчетов(ДанныеОбОстатке)
	
	ШаблонНаименования = "Справочник.%1";
	
	СправочникБанки = ОбщегоНазначенияБЭДПовтИсп.ИмяПрикладногоСправочника("Банки");
	Если Не ЗначениеЗаполнено(СправочникБанки) Тогда
		Возврат;
	КонецЕсли;
		
	СправочникБанковскиеСчета = ОбщегоНазначенияБЭДПовтИсп.ИмяПрикладногоСправочника("БанковскиеСчетаОрганизаций");
	Если Не ЗначениеЗаполнено(СправочникБанковскиеСчета) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаНомерСчета = ОбменСБанкамиСлужебный.ИмяПрикладногоРеквизита(
		"БанковскийСчетОрганизации.НомерСчета");
	
	ИмяРеквизитаБанк = ОбменСБанкамиСлужебный.ИмяПрикладногоРеквизита(
		"БанковскийСчетОрганизации.Банк");
	
	ИмяРеквизитаОрганизация = ОбменСБанкамиСлужебный.ИмяПрикладногоРеквизита(
		"БанковскийСчетОрганизации.Организация");
	
	СправочникБанковскиеСчетаМетаданные = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(
		СтрШаблон(ШаблонНаименования, СправочникБанковскиеСчета));
	
	ЕстьРеквизитДатаЗакрытия = Ложь;
	ИмяРеквизитаСчетЗакрыт = "ДатаЗакрытия";
	РеквизитСправочникаДатаЗакрытия = СправочникБанковскиеСчетаМетаданные.Реквизиты.Найти(ИмяРеквизитаСчетЗакрыт);
	
	Если Не РеквизитСправочникаДатаЗакрытия = Неопределено 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитСправочникаДатаЗакрытия, "Тип")
		И ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(РеквизитСправочникаДатаЗакрытия.Тип, Тип("Дата")) Тогда
			ЕстьРеквизитДатаЗакрытия = Истина;
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	NULL КАК Организация,
		|	NULL КАК Банк,
		|	NULL КАК НомерСчета,
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.Наименование КАК Наименование
		|ИЗ
		|	СправочникБанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	&ПолеОтбораОрганизации = &Организация
		|	И &ПолеОтбораБанк = &Банк
		|	И БанковскиеСчета.ПометкаУдаления = ЛОЖЬ
		|	И &СчетДействует";
	  
	ШаблонПоля = "БанковскиеСчета.%1 КАК Организация";
	ШаблонОтбора = "БанковскиеСчета.%1";
	Если ЗначениеЗаполнено(ИмяРеквизитаОрганизация) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Организация", 
			СтрШаблон(ШаблонПоля, ИмяРеквизитаОрганизация));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОтбораОрганизации", 
			СтрШаблон(ШаблонОтбора, ИмяРеквизитаОрганизация));
	КонецЕсли;
	
	ШаблонПоля = "БанковскиеСчета.%1 КАК Банк";
	Если ЗначениеЗаполнено(ИмяРеквизитаБанк) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК Банк", 
			СтрШаблон(ШаблонПоля, ИмяРеквизитаБанк));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеОтбораБанк", 
			СтрШаблон(ШаблонОтбора, ИмяРеквизитаБанк));
	КонецЕсли;
	
	ШаблонПоля = "БанковскиеСчета.%1 КАК НомерСчета";
	Если ЗначениеЗаполнено(ИмяРеквизитаНомерСчета) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "NULL КАК НомерСчета", 
			СтрШаблон(ШаблонПоля, ИмяРеквизитаНомерСчета));
	КонецЕсли;
	
	ШаблонПоля = "БанковскиеСчета.%1 = ДАТАВРЕМЯ(1, 1, 1)";
	Если ЕстьРеквизитДатаЗакрытия Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СчетДействует", 
			СтрШаблон(ШаблонПоля, ИмяРеквизитаСчетЗакрыт));
	КонецЕсли;
	
	ШаблонТаблицы = "Справочник.%1";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СправочникБанковскиеСчета", 
			СтрШаблон(ШаблонТаблицы, СправочникБанковскиеСчета));
			
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Банк", Банк);
	Если Не ЕстьРеквизитДатаЗакрытия Тогда
		Запрос.УстановитьПараметр("СчетДействует", Истина);
	КонецЕсли;
	
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	
	Пока РезультатВыборка.Следующий() Цикл
		
		СтрокаТаблицы = СписокСчетов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыборка);
		ДанныеПоСчету = ДанныеОбОстатке.Получить(РезультатВыборка.НомерСчета);
		Если ДанныеПоСчету <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеПоСчету);
			СтрокаТаблицы.ДатаВыписки = СтрШаблон(НСтр("ru = 'Выписка от %1'"), ДанныеПоСчету.ДатаФормирования);
			СтрокаТаблицы.СуммаОстаткаСтрока = СтрШаблон(НСтр("ru = '%1 Выписка от %2'"), 
				Формат(ДанныеПоСчету.Остаток, "ЧЦ=15; ЧДЦ=2"),
				Формат(ДанныеПоСчету.ДатаФормирования, НСтр("ru='ДФ=''dd.MM.yy HH:mm'''")));
		КонецЕсли;
		
	КонецЦикла;
	
	СписокСчетов.Сортировать("Остаток Убыв");
	
КонецПроцедуры

#КонецОбласти
